TEMP/Documents/COV_СертификатОВакцинацииОтCOVID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>COV_СертификатОВакцинацииОтCOVID</Name>
			<BasedOn>
				<xr:Item>Document.COV_ПрохождениеВакцинацииОтCOVID</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.COV_СертификатыОВакцинацииОтCOVID</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.COV_ПрохождениеВакцинацииОтCOVID</v8:Type>
						<v8:Type>cfg:DocumentRef.COV_ПрохождениеВакцинацииГрупповой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВакцины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.COV_ТипыВакцины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДействияССертификатом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийСертификат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.COV_СертификатОВакцинацииОтCOVID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

TEMP/Documents/COV_СертификатОВакцинацииОтCOVID/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДокументОснование") Тогда // на основании
		Если ТипЗнч(Параметры.ДокументОснование) = Тип("ДокументСсылка.COV_ПрохождениеВакцинацииГрупповой") Тогда 
			Объект.ДокументОснование = Параметры.ДокументОснование;
			Объект.НачалоДействияСертификата = Параметры.ДатаВакцинации;
			Объект.КонецДействияСертификата = ДобавитьМесяц(Параметры.ДатаВакцинации, 12)-1;
			Объект.СертификатДействителен = Истина;
			Объект.Сотрудник = Параметры.Сотрудник;
			Объект.ТипВакцины = Параметры.ТипВакцины;
			Объект.ОснованиеДействияССертификатом = Параметры.ОснованиеДействияССертификатом;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда // ЭтоНовый
		Объект.СертификатДействителен = Истина;
	КонецЕсли;
	
КонецПроцедуры
